sensor-web-observer/src/test/resources/GetObservationRequest.txt

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><soap:Body><ns:GetObservation service="SOS" version="2.0.0" xsi:schemaLocation="http://www.opengis.net/sos/2.0 http://schemas.opengis.net/sos/2.0/sosGetObservation.xsd" xmlns:ns="http://www.opengis.net/sos/2.0" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><ns:procedure>Einzelwert</ns:procedure><ns:offering>Zeitreihen_Einzelwert</ns:offering><ns:observedProperty>Wassertemperatur</ns:observedProperty><ns:temporalFilter><ns1:During xmlns:ns1="http://www.opengis.net/fes/2.0"><ns1:ValueReference>phenomenonTime</ns1:ValueReference><ns2:TimePeriod ns2:id="tp_663ccea4e97cf653a533f0b936d78369144d3e6c014bc2715eb971414386afeb" xmlns:ns2="http://www.opengis.net/gml/3.2"><ns2:beginPosition>2018-03-02T23:59:59.000+01:00</ns2:beginPosition><ns2:endPosition>2018-03-03T12:00:01.000+01:00</ns2:endPosition></ns2:TimePeriod></ns1:During></ns:temporalFilter><ns:featureOfInterest>Laaken</ns:featureOfInterest><ns:responseFormat>http://www.opengis.net/om/2.0</ns:responseFormat></ns:GetObservation></soap:Body></soap:Envelope>